# –¢–µ—Å—Ç–æ–≤–æ–µ –∑–∞–¥–∞–Ω–∏–µ –Ω–∞ –ø–æ–∑–∏—Ü–∏—é Game Data analyst

–î–ª—è –≤—ã–ø–æ–ª–Ω–µ–Ω–∏—è –¥–∞–Ω–Ω–æ–≥–æ –∑–∞–¥–∞–Ω–∏—è –ø—Ä–µ–¥–ª–∞–≥–∞–µ—Ç—Å—è –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å —Å–ª–µ–¥—É—é—â—É—é —Å—Ç—Ä—É–∫—Ç—É—Ä—É –¥–∞–Ω–Ω—ã—Ö:

*	–¢–∞–±–ª–∏—Ü–∞ "users" —Å –ø–æ–ª—è–º–∏: id, name, email, created_at

*	–¢–∞–±–ª–∏—Ü–∞ "orders" —Å –ø–æ–ª—è–º–∏: id, user_id, total_price, created_at

*	–¢–∞–±–ª–∏—Ü–∞ "order_items" —Å –ø–æ–ª—è–º–∏: id, order_id, product_name, price, quantity

–í –æ—Ç–≤–µ—Ç–µ –ø—Ä–∏—à–ª–∏—Ç–µ –∏–º—è –∏ –≤–µ—Ä—Å–∏—é –∏—Å–ø–æ–ª—å–∑—É–µ–º–æ–π –±–¥, –¥–∞–º–ø —Å—Ç—Ä—É–∫—Ç—É—Ä—ã –±–∞–∑—ã, –∞ —Ç–∞–∫–∂–µ –∑–∞–ø—Ä–æ—Å—ã –¥–ª—è –∑–∞–ø–æ–ª–Ω–µ–Ω–∏—è —Ç–µ—Å—Ç–æ–≤—ã–º–∏ –¥–∞–Ω–Ω—ã–º–∏, –≤ —Ä–∞–±–æ—Ç–µ —Å—Ç—Ä–æ–∫ –¥–æ–ª–∂–Ω–æ –±—ã—Ç—å –Ω–µ –º–µ–Ω–µ–µ 1 –º–ª–Ω –≤ –∫–∞–∂–¥–æ–π —Ç–∞–±–ª–∏—Ü–µ.
–û—Ç–≤–µ—Ç –¥–æ–ª–∂–µ–Ω –ø—Ä–µ–¥—Å—Ç–∞–≤–ª—è—Ç—å –∏–∑ —Å–µ–±—è SQL –∑–∞–ø—Ä–æ—Å —Å –ø–æ—è—Å–Ω–µ–Ω–∏–µ–º. –ü–æ –∂–µ–ª–∞–Ω–∏—é –º–æ–∂–µ—Ç–µ –¥–æ–ø–æ–ª–Ω–∏—Ç—å –≤–∞—à –æ—Ç–≤–µ—Ç –ø–ª–æ—Ö–∏–º –≤–∞—Ä–∏–∞–Ω—Ç–æ–º –∑–∞–ø—Ä–æ—Å–∞ —Ç–∞–∫–∂–µ —Å –æ–±—ä—è—Å–Ω–µ–Ω–∏–µ–º.

–ó–∞–ø—Ä–æ—Å—ã:

1.	–ù–∞–π—Ç–∏ –æ–±—â–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ –∫–∞–∂–¥–æ–≥–æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –∫–æ—Ç–æ—Ä—ã–π —Å–¥–µ–ª–∞–ª –±–æ–ª–µ–µ 10 –∑–∞–∫–∞–∑–æ–≤.

2.	–ù–∞–π—Ç–∏ —Å—Ä–µ–¥–Ω–∏–π —Ä–∞–∑–º–µ—Ä –∑–∞–∫–∞–∑–∞ –¥–ª—è –∫–∞–∂–¥–æ–≥–æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è –∑–∞ –ø–æ—Å–ª–µ–¥–Ω–∏–π –º–µ—Å—è—Ü.

3.	–ù–∞–π—Ç–∏ —Å—Ä–µ–¥–Ω–∏–π —Ä–∞–∑–º–µ—Ä –∑–∞–∫–∞–∑–∞ –∑–∞ –∫–∞–∂–¥—ã–π –º–µ—Å—è—Ü –≤ —Ç–µ–∫—É—â–µ–º –≥–æ–¥—É –∏ —Å—Ä–∞–≤–Ω–∏—Ç—å –µ–≥–æ —Å —Å—Ä–µ–¥–Ω–∏–º —Ä–∞–∑–º–µ—Ä–æ–º –∑–∞–∫–∞–∑–∞ –∑–∞ —Å–æ–æ—Ç–≤–µ—Ç—Å—Ç–≤—É—é—â–∏–π –º–µ—Å—è—Ü –≤ –ø—Ä–æ—à–ª–æ–º –≥–æ–¥—É.

4.	–ù–∞–π—Ç–∏ 10 –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, —É –∫–æ—Ç–æ—Ä—ã—Ö –Ω–∞–∏–±–æ–ª—å—à–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ –∑–∞ –ø–æ—Å–ª–µ–¥–Ω–∏–π –≥–æ–¥, –∏ –¥–ª—è –∫–∞–∂–¥–æ–≥–æ –∏–∑ –Ω–∏—Ö –Ω–∞–π—Ç–∏ —Å—Ä–µ–¥–Ω–∏–π —Ä–∞–∑–º–µ—Ä –∑–∞–∫–∞–∑–∞ –∑–∞ –ø–æ—Å–ª–µ–¥–Ω–∏–π –º–µ—Å—è—Ü.

_____________________________________________________________________

### 1. –°–≥–µ–Ω–µ—Ä–∏—Ä—É–µ–º —Å–∏–Ω—Ç–µ—Ç–∏—á–µ—Å–∫–∏–µ –¥–∞–Ω–Ω—ã–µ –¥–ª—è –≤—ã–ø–æ–ª–Ω–µ–Ω–∏—è –¥–∞–Ω–Ω–æ–≥–æ –∑–∞–¥–∞–Ω–∏—è


File: 02 synthetic_data_generating.ipynb


_____________________________________________________________________________

### 2. –ó–∞–ª—å—ë–º –ø–æ–ª—É—á–µ–Ω–Ω—ã–µ –¥–∞–Ω–Ω—ã–µ –≤ –ë–î

–ò–º—è –∏ –≤–µ—Ä—Å–∏—è –∏—Å–ø–æ–ª—å–∑—É–µ–º–æ–π –±–¥: <span style="color:#FF7F50"> **PostgreSQL 16.4**</span> 

–î–∞–º–ø —Å—Ç—Ä—É–∫—Ç—É—Ä—ã –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö –≤ File: <span style="color:#FF7F50"> **schema_dump.sql**</span>

##### –®–∞–≥ 1. –° –ø–æ–º–æ—â—å—é –≤–∏–∑—É–∞–ª—å–Ω–æ–≥–æ —Ä–µ–¥–∞–∫—Ç–æ—Ä–∞ –¥–ª—è PostgresSQL –ø—Ä–æ–≥—Ä–∞–º–º—ã PgAdmin —Å–æ–∑–¥–∞–¥–∏–º –ë–î "happy_games".

##### –®–∞–≥ 2. –°–æ–∑–¥–∞–¥–∏–º –Ω–µ–æ–±—Ö–æ–¥–∏–º—ã–µ —Ç–∞–±–ª–∏—Ü—ã

In [1]:
# 1. –ò–º–ø–æ—Ä—Ç–∏—Ä—É–µ–º –Ω–µ–æ–±—Ö–æ–¥–∏–º—ã–µ –±–∏–±–ª–∏–æ—Ç–µ–∫–∏.
import pandas as pd
import numpy as np
import psycopg2 as ps
from sqlalchemy import create_engine, text

In [2]:
# 1. –°–æ–∑–¥–∞–¥–∏–º –Ω–æ–≤–æ–µ –ø–æ–¥–∫–ª—é—á–µ–Ω–∏–µ –∫ –ë–î —á–µ—Ä–µ–∑ sqlalchemy
conn = create_engine('postgresql+psycopg2://postgres:maz505+5@localhost:5432/happy_games')

In [3]:
# –§—É–Ω–∫—Ü–∏—è –¥–ª—è –≤—ã–ø–æ–ª–Ω–µ–Ω–∏—è –∑–∞–ø—Ä–æ—Å–æ–≤ –Ω–∞ –∏–∑–º–µ–Ω–µ–Ω–∏–µ —Å—Ç—Ä—É–∫—Ç—É—Ä—ã –ë–î
def execute_query(sql):
    with conn.connect() as connection:
        connection.execute(text(sql))
        connection.commit()

# –§—É–Ω–∫—Ü–∏—è –¥–ª—è –≤—ã–ø–æ–ª–Ω–µ–Ω–∏—è SELECT-–∑–∞–ø—Ä–æ—Å–æ–≤
def select(sql):
    with conn.connect() as connection:
        return pd.read_sql(sql, connection)

In [4]:
# 4. –°–æ–∑–¥–∞–¥–∏–º –Ω–∞—à—É –ø–µ—Ä–≤—É—é —Ç–∞–±–ª–∏—Ü—É "users"  —Å–æ —Å–ª–µ–¥—É—é—â–µ–π —Å—Ç—Ä—É–∫—Ç—É—Ä–æ–π –¥–∞–Ω–Ω—ã—Ö:
#      id: SERIAL PRIMARY KEY
#      name: VARCHAR(50) 
#      email: VARCHAR(50)
#      created_at: DATE

sql = """CREATE TABLE IF NOT EXISTS users (
               id SERIAL PRIMARY KEY, 
               name VARCHAR(50), 
               email VARCHAR(60) UNIQUE, 
               created_at DATE)
       """
execute_query(sql)

In [5]:
# 5. –ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ —Å–æ–∑–¥–∞–¥–∏–º  —Ç–∞–±–ª–∏—Ü—É "orders" —Å–æ —Å–ª–µ–¥—É—é—â–µ–π —Å—Ç—Ä—É–∫—Ç—É—Ä–æ–π –¥–∞–Ω–Ω—ã—Ö:
#      id: SERIAL PRIMARY KEY
#      user_id: INTEGER NOT NULL
#      total_price: NUMERIC(10, 2)
#      created_at: DATE
#      FOREIGN KEY (user_id) REFERENCES users (id)

sql = """CREATE TABLE IF NOT EXISTS orders (
               id SERIAL PRIMARY KEY, 
               user_id INTEGER NOT NULL, 
               total_price NUMERIC(10, 2), 
               created_at DATE, 
               FOREIGN KEY (user_id) REFERENCES users(id))
      """

execute_query(sql)

In [6]:
# 6. –°–æ–∑–¥–∞–¥–∏–º —Ç–∞–±–ª–∏—Ü—É order_items —Å–æ —Å–ª–µ–¥—É—é—â–µ–π —Å—Ç—Ä—É–∫—Ç—É—Ä–æ–π –¥–∞–Ω–Ω—ã—Ö:
#       id: SERIAL PRIMARY KEY
#       order_id: INTEGER NOT NULL
#       product_name: VARCHAR(50) 
#       price: NUMERIC(10, 2) 
#       quantity: INTEGER 
#       FOREIGN KEY (order_id) REFERENCES orders (id)
sql = """CREATE TABLE IF NOT EXISTS order_items (
               id SERIAL PRIMARY KEY, 
               order_id INTEGER NOT NULL, 
               product_name VARCHAR(50), 
               price NUMERIC(10, 2), 
               quantity INTEGER, 
               FOREIGN KEY (order_id) REFERENCES orders (id))
      """
execute_query(sql)

#### –®–∞–≥ 3. –ü—Ä–∏—Å—Ç—É–ø–∏–º –∫ –∑–∞–ø–æ–ª–Ω–µ–Ω–∏—é —Ç–∞–±–ª–∏—Ü

In [7]:
# 2. –ú–µ—Ç–æ–¥ –¥–ª—è —É—Å–∫–æ—Ä–µ–Ω–∏—è –ø—Ä–æ—Ü–µ—Å—Å–∞ –∑–∞–ø–∏—Å–∏ –¥–∞–Ω–Ω—ã—Ö (https://stackoverflow.com/a/55495065/4527289)

import csv
from io import StringIO

def psql_insert_copy(table, conn, keys, data_iter):
    # gets a DBAPI connection that can provide a cursor
    dbapi_conn = conn.connection
    with dbapi_conn.cursor() as cur:
        s_buf = StringIO()
        writer = csv.writer(s_buf)
        writer.writerows(data_iter)
        s_buf.seek(0)

        columns = ', '.join('"{}"'.format(k) for k in keys)
        if table.schema:
            table_name = '{}.{}'.format(table.schema, table.name)
        else:
            table_name = table.name

        sql = 'COPY {} ({}) FROM STDIN WITH CSV'.format(
            table_name, columns)
        cur.copy_expert(sql=sql, file=s_buf)

In [8]:
# 3. –°—á–∏—Ç—ã–≤–∞–µ–º —Ä–∞–Ω–µ–µ —Å–≥–µ–Ω–µ—Ä–∏—Ä–æ–≤–∞–Ω–Ω—ã–µ –¥–∞–Ω–Ω—ã–µ, –∞ –∏–º–µ–Ω–Ω–æ users.csv.
#    –¢–∞–∫ –∫–∞–∫ –∫–æ–ª–æ–Ω–∫–∞ 'id' —É –Ω–∞—Å –±—É–¥–µ—Ç —è–≤–ª—è—Ç—å—Å—è –ø–µ—Ä–≤–∏—á–Ω—ã–º –∫–ª—é—á–æ–º, –∏ –º—ã –ø—Ä–∏ —Å–æ–∑–¥–∞–Ω–∏–∏ —Ç–∞–±–ª–∏—Ü—ã –Ω–∞ –ø—Ä–µ–¥—ã–¥—É—â–µ–º —à–∞–≥–µ 
#    —É—Å—Ç–∞–Ω–∞–≤–∏–ª–∏ –ø–∞—Ä–∞–º–µ—Ç—Ä—ã –¥–ª—è –Ω–µ—ë SERIAL PRIMARY KEY, –∏–∑–±–∞–≤–∏–º—Å—è –æ—Ç –∫–æ–ª–æ–Ω–æ–∫ 'id' –≤ –Ω–∞—à–∏—Ö –¥–∞—Ç–∞—Ñ—Ä–µ–π–º–∞—Ö.
df_users = pd.read_csv('users.csv', parse_dates=['created_at'])
df_users.head(2)

            name                           email created_at
0  Chelsey White  chelsey.white0@googlyandex.com 2023-01-01
1  Gregory Allen  gregory.allen1@googlyandex.com 2023-01-01

In [9]:
# 4. –ò—Å–ø–æ–ª—å–∑—É–µ–º –º–µ—Ç–æ–¥ to_sql() —É –æ–±—ä–µ–∫—Ç–∞ DataFrame –¥–ª—è –≤—Å—Ç–∞–≤–∫–∏ –¥–∞–Ω–Ω—ã—Ö –≤ —Ç–∞–±–ª–∏—Ü—É –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö.
df_users.to_sql('users', conn, if_exists='append', index=False, method=psql_insert_copy)

In [10]:
# –ü—Ä–æ–≤–µ—Ä–∏–º, —Å–¥–µ–ª–∞–≤ –ø–µ—Ä–≤—ã–π –∑–∞–ø—Ä–æ—Å.
sql = '''SELECT * FROM users LIMIT 5'''
select(sql)

   id           name                           email  created_at
0   1  Chelsey White  chelsey.white0@googlyandex.com  2023-01-01
1   2  Gregory Allen  gregory.allen1@googlyandex.com  2023-01-01
2   3   Rachel Jones   rachel.jones2@googlyandex.com  2023-01-01
3   4    James Evans    james.evans3@googlyandex.com  2023-01-01
4   5   Sarah Fisher   sarah.fisher4@googlyandex.com  2023-01-01

In [11]:
# 5. –°—á–∏—Ç—ã–≤–∞–µ–º —Ä–∞–Ω–µ–µ —Å–≥–µ–Ω–µ—Ä–∏—Ä–æ–≤–∞–Ω–Ω—ã–π —Ñ–∞–π–ª orders.csv.
df_orders = pd.read_csv('orders.csv', parse_dates=['created_at'])
df_orders.head(2)

   user_id created_at  total_price
0     2774 2023-01-29        18090
1     2686 2023-01-29         1320

In [12]:
# 6. –ò—Å–ø–æ–ª—å–∑—É–µ–º –º–µ—Ç–æ–¥ to_sql() —É –æ–±—ä–µ–∫—Ç–∞ DataFrame –¥–ª—è –≤—Å—Ç–∞–≤–∫–∏ –¥–∞–Ω–Ω—ã—Ö –≤ —Ç–∞–±–ª–∏—Ü—É –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö.
df_orders.to_sql('orders', conn, if_exists='append', index=False, method=psql_insert_copy)

In [13]:
# –ü—Ä–æ–≤–µ—Ä–∏–º, —Å–¥–µ–ª–∞–≤ –∑–∞–ø—Ä–æ—Å.
sql = '''SELECT * FROM orders LIMIT 5'''
select(sql)

   id  user_id  total_price  created_at
0   1     2774      18090.0  2023-01-29
1   2     2686       1320.0  2023-01-29
2   3     2147        340.0  2023-01-29
3   4       97        450.0  2023-01-29
4   5     1924      12710.0  2023-01-29

In [14]:
# 7. –ü–æ –∞–Ω–∞–ª–æ–≥–∏–∏ —Å –ø—Ä–µ–¥—ã–¥—É—â–∏–º–∏ —à–∞–≥–∞–º–∏.
df_order_items = pd.read_csv('order_items.csv')

df_order_items.head(2)

   order_id           product_name  price  quantity
0         1  Prod.‚Ññ: kDOe-12612877    270        67
1         2  Prod.‚Ññ: jMCN-28203691    165         8

In [15]:
df_order_items.to_sql('order_items', conn, if_exists='append', index=False, method=psql_insert_copy)

In [16]:
sql = '''SELECT * FROM order_items LIMIT 5'''
select(sql)

   id  order_id           product_name  price  quantity
0   1         1  Prod.‚Ññ: kDOe-12612877  270.0        67
1   2         2  Prod.‚Ññ: jMCN-28203691  165.0         8
2   3         3  Prod.‚Ññ: NqEu-83181983   10.0        34
3   4         4  Prod.‚Ññ: ELjg-02215747   50.0         9
4   5         5  Prod.‚Ññ: ZlNz-37570014  310.0        41

__________________________________________________


### 3. –ü—Ä–∏—Å—Ç—É–ø–∏–º –∫ —Å–æ—Å—Ç–∞–≤–ª–µ–Ω–∏—é –∑–∞–ø—Ä–æ—Å–æ–≤, –¥–ª—è –æ—Ç–≤–µ—Ç–æ–≤ –Ω–∞ –ø–æ—Å—Ç–∞–≤–ª–µ–Ω–Ω—ã–µ –≤–æ–ø—Ä–æ—Å—ã

1. –ù–∞–π—Ç–∏ –æ–±—â–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ –∫–∞–∂–¥–æ–≥–æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è, –∫–æ—Ç–æ—Ä—ã–π —Å–¥–µ–ª–∞–ª –±–æ–ª–µ–µ 10 –∑–∞–∫–∞–∑–æ–≤.
   
   –¢–∞–±–ª–∏—Ü–∞ "orders" —Å –ø–æ–ª—è–º–∏: id, user_id, total_price, created_at

In [17]:
# ‚ö†Ô∏è –ù–µ –æ–ø—Ç–∏–º–∞–ª—å–Ω—ã–µ –∑–∞–ø—Ä–æ—Å—ã ‚ùóÔ∏è‚ùóÔ∏è‚ùóÔ∏è

# 1—ã–π –≤–∞—Ä–∏–∞–Ω—Ç —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º CTE ‚ùå
sql1 = '''
WITH cte AS (SELECT o.user_id AS user_id
               FROM orders o                
              GROUP BY 1
             HAVING count(distinct o.id) > 10
             )
             
  SELECT o.user_id, u.name, u.email,
         COUNT(DISTINCT o.id)  AS cnt_orders       
    FROM orders o JOIN cte 
         ON o.user_id = cte.user_id
                  JOIN users u
         ON o.user_id = u.id
   GROUP BY 1, 2, 3
       '''
# –≠—Ç–æ—Ç –∑–∞–ø—Ä–æ—Å –∏—Å–ø–æ–ª—å–∑—É–µ—Ç CTE –¥–ª—è –≤—ã–±–æ—Ä–∞ –≤—Å–µ—Ö –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, —É –∫–æ—Ç–æ—Ä—ã—Ö –µ—Å—Ç—å –±–æ–ª–µ–µ 10 –∑–∞–∫–∞–∑–æ–≤. 
# –ó–∞—Ç–µ–º, –∑–∞–ø—Ä–æ—Å –ø—Ä–∏—Å–æ–µ–¥–∏–Ω—è–µ—Ç —ç—Ç–∏—Ö –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π –∫ —Ç–∞–±–ª–∏—Ü–µ orders —Å –ø–æ–º–æ—â—å—é INNER JOIN, 
# —Ç–µ–º —Å–∞–º—ã–º –æ—Ç–±–∏—Ä–∞—è —Ç–æ–ª—å–∫–æ –Ω—É–∂–Ω—ã–µ –Ω–∞–º –¥–∞–Ω–Ω—ã–µ.
# –ï—Å–ª–∏ –µ—Å—Ç—å –Ω–µ–æ–±—Ö–æ–¥–∏–º–æ—Å—Ç—å, —Ç–æ –µ—â—ë –¥–∂–æ–π–Ω–∏–º —Ç–∞–±–ª–∏—Ü—É users –∏ –ø–æ–ª—É—á–∞–µ–º –ø–æ–¥—Ä–æ–±–Ω—É—é –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—é –ø–æ —é–∑–µ—Ä–∞–º.
# –¢–∞–∫ –∂–µ —ç—Ç—É –∑–∞–¥–∞—á—É –º–æ–∂–Ω–æ —Ä–µ—à–∏—Ç—å –∏—Å–ø–æ–ª—å–∑—É—è –ø–æ–¥–∑–∞–ø—Ä–æ—Å –≤–º–µ—Å—Ç–æ CTE.

# 2–æ–π –≤–∞—Ä–∏–∞–Ω—Ç —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º –ø–æ–¥–∑–∞–ø—Ä–æ—Å–∞ –≤ JOIN ‚ùå
sql2 = '''
     SELECT o.user_id, u.name, u.email,
            COUNT(DISTINCT o.id)  AS cnt_orders       
       FROM orders o
            JOIN                                      
                 (SELECT o.user_id AS user_id
                    FROM orders o                
                   GROUP BY 1
                  HAVING count(distinct o.id) > 10
                  ) AS q 
              ON o.user_id = q.user_id
            JOIN users u
              ON o.user_id = u.id
     GROUP BY 1, 2, 3
       '''
# –ê–Ω–∞–ª–æ–≥–∏—á–µ–Ω –ø–µ—Ä–≤–æ–º—É, —Ñ–∏–ª—å—Ç—Ä—É–µ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π —á–µ—Ä–µ–∑ –ø–æ–¥–∑–∞–ø—Ä–æ—Å –≤ JOIN, –∞ –∑–∞—Ç–µ–º –≤—ã–ø–æ–ª–Ω—è–µ—Ç –∞–≥—Ä–µ–≥–∏—Ä–æ–≤–∞–Ω–∏–µ.

# 3–∏–π –≤–∞—Ä–∏–∞–Ω—Ç —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º –ø–æ–¥–∑–∞–ø—Ä–æ—Å–∞ –≤ JOIN –∏ –æ–∫–æ–Ω–Ω—ã—Ö —Ñ—É–Ω–∫—Ü–∏–π ‚ùå
sql3 = '''
SELECT q.user_id, u.name, u.email,
       q.total_cnt_orders
  FROM
       (SELECT o.user_id AS user_id,
               o.id AS order_id,
               COUNT(o.id) OVER (PARTITION BY o.user_id) AS total_cnt_orders
          FROM orders o
        ) AS q
        JOIN users u
              ON q.user_id = u.id
 WHERE q.total_cnt_orders > 10
 GROUP BY 1, 2, 3, 4
'''
# –†–∞—Å—Å—á–∏—Ç—ã–≤–∞–µ—Ç –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ –¥–ª—è –∫–∞–∂–¥–æ–≥–æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º –æ–∫–æ–Ω–Ω–æ–π —Ñ—É–Ω–∫—Ü–∏–∏ –∏ –æ—Ç–±–∏—Ä–∞–µ—Ç –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π —Å –±–æ–ª–µ–µ —á–µ–º 10 –∑–∞–∫–∞–∑–∞–º–∏ —á–µ—Ä–µ–∑ —Ñ–∏–ª—å—Ç—Ä WHERE.
# –û–¥–Ω–∞–∫–æ, –æ–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏ –º–æ–≥—É—Ç –±—ã—Ç—å –±–æ–ª–µ–µ —Ä–µ—Å—É—Ä—Å–æ–µ–º–∫–∏–º–∏, —Ç–∞–∫ –∫–∞–∫ –æ–Ω–∏ –ø–æ–¥—Å—á–∏—Ç—ã–≤–∞—é—Ç –¥–∞–Ω–Ω—ã–µ –¥–ª—è –∫–∞–∂–¥–æ–π —Å—Ç—Ä–æ–∫–∏, –∞ –∑–∞—Ç–µ–º –≤—ã–ø–æ–ª–Ω—è–µ—Ç—Å—è —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏—è.
# –í—Å–µ —Ç—Ä–∏ –∑–∞–ø—Ä–æ—Å–∞ —Å–æ–¥–µ—Ä–∂–∞—Ç –¥–æ–ø–æ–ª–Ω–∏—Ç–µ–ª—å–Ω—ã–µ –æ–ø–µ—Ä–∞—Ü–∏–∏ –¥–ª—è –≤—ã–ø–æ–ª–Ω–µ–Ω–∏—è —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏–∏ —á–µ—Ä–µ–∑ –æ—Ç–¥–µ–ª—å–Ω—ã–π –Ω–∞–±–æ—Ä –¥–∞–Ω–Ω—ã—Ö (CTE –∏–ª–∏ –ø–æ–¥–∑–∞–ø—Ä–æ—Å).
# –ù–æ, –∑–¥–µ—Å—å –Ω–µ—Ç —Ä–µ–∞–ª—å–Ω–æ–π –Ω–µ–æ–±—Ö–æ–¥–∏–º–æ—Å—Ç–∏ –≤ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–∏ CTE/–ø–æ–¥–∑–∞–ø—Ä–æ—Å–∞, –ø–æ—Å–∫–æ–ª—å–∫—É –º—ã –º–æ–∂–µ–º –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏—é –Ω–µ–ø–æ—Å—Ä–µ–¥—Å—Ç–≤–µ–Ω–Ω–æ –≤ –æ—Å–Ω–æ–≤–Ω–æ–º –∑–∞–ø—Ä–æ—Å–µ.
# –í –æ–±—â–µ–º, —ç—Ç–æ –ø–µ—Ä–≤–æ–Ω–∞—á–∞–ª—å–Ω—ã–µ –∏ –Ω–µ —Å–∞–º—ã–µ –æ–ø—Ç–∏–º–∞–ª—å–Ω—ã–µ –≤–µ—Ä—Å–∏–∏ –∑–∞–ø—Ä–æ—Å–∞, –ø–æ–ø—Ä–æ–±—É–µ–º –∏—Ö –æ–ø—Ç–∏–º–∏–∑–∏—Ä–æ–≤–∞—Ç—å –∏ –ø–æ–ª—É—á–∏–º:

# ---------------------------------------------------------------------------------------------------------------------------------------------

#  –û–ø—Ç–∏–º–∞–ª—å–Ω—ã–π –∑–∞–ø—Ä–æ—Å üöÄüî•‚úÖ
# 4—ã–π –≤–∞—Ä–∏–∞–Ω—Ç –±–µ–∑ CTE –∏ –ø–æ–¥–∑–∞–ø—Ä–æ—Å–∞

sql4 = '''
SELECT o.user_id, u.name, u.email,
       COUNT(DISTINCT o.id) AS cnt_orders
  FROM orders o
       JOIN users u
         ON o.user_id = u.id
 GROUP BY o.user_id, u.name, u.email
HAVING COUNT(DISTINCT o.id) > 10;
      '''

print(f'1–∞—è –≤–µ—Ä—Å–∏—è –∑–∞–ø—Ä–æ—Å–∞ —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º CTE ‚ùå:\n{select(sql1).head(3)}')
print('------------------     ------------------     ------------------')
print(f'2–æ–π –≤–∞—Ä–∏–∞–Ω—Ç –∑–∞–ø—Ä–æ—Å–∞ —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º CTE ‚ùå:\n{select(sql2).head(3)}')
print('------------------     ------------------     ------------------')
print(f'3–∏–π –≤–∞—Ä–∏–∞–Ω—Ç —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º –ø–æ–¥–∑–∞–ø—Ä–æ—Å–∞ –≤ JOIN –∏ –æ–∫–æ–Ω–Ω—ã—Ö —Ñ—É–Ω–∫—Ü–∏–π ‚ùå:\n{select(sql3).head(3)}')
print('------------------     ------------------     ------------------')
print(f'4—ã–π –≤–∞—Ä–∏–∞–Ω—Ç –∑–∞–ø—Ä–æ—Å–∞ –±–µ–∑ CTE ‚úÖ:\n{select(sql4).head(3)}')

1–∞—è –≤–µ—Ä—Å–∏—è –∑–∞–ø—Ä–æ—Å–∞ —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º CTE ‚ùå:
   user_id                   name                                     email  \
0        1          Chelsey White            chelsey.white0@googlyandex.com
1       85             Adam Smith              adam.smith84@googlyandex.com
2      168  Gregory Armstrong DDS  gregory.armstrong.dds167@googlyandex.com

   cnt_orders
0          11
1          11
2          11
------------------     ------------------     ------------------
2–æ–π –≤–∞—Ä–∏–∞–Ω—Ç –∑–∞–ø—Ä–æ—Å–∞ —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º CTE ‚ùå:
   user_id                   name                                     email  \
0        1          Chelsey White            chelsey.white0@googlyandex.com
1       85             Adam Smith              adam.smith84@googlyandex.com
2      168  Gregory Armstrong DDS  gregory.armstrong.dds167@googlyandex.com

   cnt_orders
0          11
1          11
2          11
------------------     ------------------     ------------------
3–∏–π –≤–∞—Ä–∏–∞–Ω—Ç —Å –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ–º –ø–æ–¥–∑–∞–ø—Ä–æ—Å–∞ –≤ JOIN –∏ –æ–∫–æ–Ω–Ω—ã—Ö —Ñ—É–Ω–∫—Ü–∏–π ‚ùå:
   user_id                   name                                     email  \
0        1          Chelsey White            chelsey.white0@googlyandex.com
1       85             Adam Smith              adam.smith84@googlyandex.com
2      168  Gregory Armstrong DDS  gregory.armstrong.dds167@googlyandex.com

   total_cnt_orders
0                11
1                11
2                11
------------------     ------------------     ------------------
4—ã–π –≤–∞—Ä–∏–∞–Ω—Ç –∑–∞–ø—Ä–æ—Å–∞ –±–µ–∑ CTE ‚úÖ:
   user_id                   name                                     email  \
0        1          Chelsey White            chelsey.white0@googlyandex.com
1       85             Adam Smith              adam.smith84@googlyandex.com
2      168  Gregory Armstrong DDS  gregory.armstrong.dds167@googlyandex.com

   cnt_orders
0          11
1          11
2          11

_______________________________________

2. –ù–∞–π—Ç–∏ —Å—Ä–µ–¥–Ω–∏–π —Ä–∞–∑–º–µ—Ä –∑–∞–∫–∞–∑–∞ –¥–ª—è –∫–∞–∂–¥–æ–≥–æ –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª—è –∑–∞ –ø–æ—Å–ª–µ–¥–Ω–∏–π –º–µ—Å—è—Ü.  
–ü–æ—Å–ª–µ–¥–Ω–∏–π –º–µ—Å—è—Ü: –∏—é–ª—å 2024.

In [18]:
# ‚ö†Ô∏è –ù–µ –æ–ø—Ç–∏–º–∞–ª—å–Ω—ã–µ –∑–∞–ø—Ä–æ—Å—ã ‚ùóÔ∏è‚ùóÔ∏è‚ùóÔ∏è

# 1—ã–π –≤–∞—Ä–∏–∞–Ω—Ç‚ùå:
sql1 = ''' 
SELECT user_id,
       ROUND(AVG(total_price),2) AS avg_total_price
  FROM orders
 WHERE to_char(created_at, 'MM-YYYY') = '08-2024' 
 GROUP BY 1
       '''
#‚ö†Ô∏è –ü—Ä–∏–º–µ–Ω–µ–Ω–∏–µ —Ñ—É–Ω–∫—Ü–∏–∏ (to_char()) –∫ –ø–æ–ª—é –≤ —Ñ–∏–ª—å—Ç—Ä–µ –º–µ—à–∞–µ—Ç –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏—é –∏–Ω–¥–µ–∫—Å–∞.

# 2–æ–π –≤–∞—Ä–∏–∞–Ω—Ç (–æ–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏) ‚ùå:
sql2 = ''' 
SELECT DISTINCT user_id,
       ROUND(AVG(orders.total_price) OVER (PARTITION BY user_id), 2) AS avg_total_price
  FROM orders
 WHERE created_at >= '2024-08-01' 
   AND created_at < '2024-09-01'
       '''
# –û–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏ –º–æ–≥—É—Ç –±—ã—Ç—å –±–æ–ª–µ–µ —Ä–µ—Å—É—Ä—Å–æ–µ–º–∫–∏–º–∏, —Ç–∞–∫ –∫–∞–∫ –æ–Ω–∏ –ø–æ–¥—Å—á–∏—Ç—ã–≤–∞—é—Ç –¥–∞–Ω–Ω—ã–µ –¥–ª—è –∫–∞–∂–¥–æ–π —Å—Ç—Ä–æ–∫–∏, –∞ –∑–∞—Ç–µ–º –≤—ã–ø–æ–ª–Ω—è–µ—Ç—Å—è —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏—è.

# ---------------------------------------------------------------------------------------------------------------------------------------------

#  –û–ø—Ç–∏–º–∞–ª—å–Ω—ã–π –∑–∞–ø—Ä–æ—Å üöÄüî•‚úÖ
#  3–∏–π –≤–∞—Ä–∏–∞–Ω—Ç :
sql3 = ''' 
SELECT user_id,
       ROUND(AVG(total_price), 2) AS avg_total_price
  FROM orders
 WHERE created_at >= '2024-08-01' 
   AND created_at < '2024-09-01'
 GROUP BY user_id;
      ''' 


print(f'1—ã–π –≤–∞—Ä–∏–∞–Ω—Ç‚ùå:\n{select(sql1).head(3)}')
print('------------------     ------------------')
print(f'2–æ–π –≤–∞—Ä–∏–∞–Ω—Ç (–æ–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏) ‚ùå:\n{select(sql2).head(3)}')
print('------------------     ------------------')
print(f'3–∏–π –≤–∞—Ä–∏–∞–Ω—Ç. –û–ø—Ç–∏–º–∞–ª—å–Ω—ã–π –∑–∞–ø—Ä–æ—Å üöÄüî•‚úÖ:\n{select(sql3).head(3)}')

1—ã–π –≤–∞—Ä–∏–∞–Ω—Ç‚ùå:
   user_id  avg_total_price
0  2155350          4673.33
1  2155351         11495.00
2  2155352         12632.50
------------------     ------------------
2–æ–π –≤–∞—Ä–∏–∞–Ω—Ç (–æ–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏) ‚ùå:
   user_id  avg_total_price
0  2155350          4673.33
1  2155351         11495.00
2  2155352         12632.50
------------------     ------------------
3–∏–π –≤–∞—Ä–∏–∞–Ω—Ç. –û–ø—Ç–∏–º–∞–ª—å–Ω—ã–π –∑–∞–ø—Ä–æ—Å üöÄüî•‚úÖ:
   user_id  avg_total_price
0  2155350          4673.33
1  2155351         11495.00
2  2155352         12632.50

_______________________________________

3. –ù–∞–π—Ç–∏ —Å—Ä–µ–¥–Ω–∏–π —Ä–∞–∑–º–µ—Ä –∑–∞–∫–∞–∑–∞ –∑–∞ –∫–∞–∂–¥—ã–π –º–µ—Å—è—Ü –≤ —Ç–µ–∫—É—â–µ–º –≥–æ–¥—É –∏ —Å—Ä–∞–≤–Ω–∏—Ç—å –µ–≥–æ —Å —Å—Ä–µ–¥–Ω–∏–º —Ä–∞–∑–º–µ—Ä–æ–º –∑–∞–∫–∞–∑–∞ –∑–∞ —Å–æ–æ—Ç–≤–µ—Ç—Å—Ç–≤—É—é—â–∏–π –º–µ—Å—è—Ü –≤ –ø—Ä–æ—à–ª–æ–º –≥–æ–¥—É.

In [19]:
# 1—ã–π –≤–∞—Ä–∏–∞–Ω—Ç (–æ–∫–æ–Ω–Ω—ã–µ —Ñ—É–Ω–∫—Ü–∏–∏) ‚úÖ:
# 1. –ù–∞ –ø–µ—Ä–≤–æ–º —ç—Ç–∞–ø–µ —Ä–µ—à–µ–Ω–∏—è –¥–∞–Ω–Ω–æ–π –∑–∞–¥–∞—á–∏ –≤—ã—á–ª–µ–Ω–∏–º –∏–∑ –¥–∞—Ç—ã 'created_at' –≥–æ–¥ –∏ –º–µ—Å—è—Ü, 
# 2. –∑–∞—Ç–µ–º –¥–∞–Ω–Ω—ã–µ –æ—Ç—Å–æ—Ä—Ç–∏—Ä—É–µ–º —Å–Ω–∞—á–∞–ª–∞ –ø–æ –≥–æ–¥—É, –∑–∞—Ç–µ–º –ø–æ –º–µ—Å—è—Ü—É.

# 3. –î–æ—Ä–∞–±–æ—Ç–∞–µ–º –ø—Ä–µ–¥—ã–¥—É—â–∏–π –∑–∞–ø—Ä–æ—Å, –¥–æ–±–∞–≤–∏–≤ –æ–∫–æ–Ω–Ω—É—é —Ñ—É–Ω–∫—Ü–∏—é —Å–º–µ—â–µ–Ω–∏—è LAG.
# 4. –î–∞–±—ã –∏–∑–±–µ–∂–∞—Ç—å –ø–æ–¥–∑–∞–ø—Ä–æ—Å–æ–≤ –ø–æ–º–µ—Å—Ç–∏–º –Ω–∞—à –∑–∞–ø—Ä–æ—Å –≤ CTE.
# 5. –û—Ç–±–µ—Ä—ë–º —Å—Ç—Ä–æ–∫–∏ —Å —Ç–µ–∫—É—â–∏–º –≥–æ–¥–æ–º.
# 6. –†–∞—Å—Å—á–∏—Ç–∞–µ–º —Ä–∞–∑–Ω–∏—Ü—É (–∞–±—Å–æ–ª—é—Ç–Ω—ã–π –ø—Ä–∏—Ä–æ—Å—Ç / —Ç–µ–º–ø —Ä–æ—Å—Ç–∞ )


sql = ''' 
WITH cte AS (
             SELECT 
                CAST(EXTRACT(YEAR FROM created_at) AS INTEGER) AS year,
                CAST(EXTRACT(MONTH FROM created_at) AS INTEGER) AS month,
                ROUND(AVG(total_price), 2) AS avg_money_2024,
                LAG(ROUND(AVG(total_price), 2)) OVER(PARTITION BY  CAST(EXTRACT(MONTH FROM created_at) AS INTEGER) ORDER BY CAST(EXTRACT(YEAR FROM created_at) AS INTEGER)) AS last_year_avg_money
             FROM orders
             GROUP BY 1, 2
             ORDER BY 2, 1 ASC
           )

SELECT month,
       avg_money_2024,
       last_year_avg_money AS avg_money_2023,
       (avg_money_2024 - last_year_avg_money) AS absolute_increase,
       (((avg_money_2024 / last_year_avg_money) - 1) * 100) AS growth_rate_in_percentage
  FROM cte
 WHERE cte.year = 2024 
'''

select(sql)

,month,avg_money_2024,avg_money_2023,absolute_increase,growth_rate_in_percentage
0,1,12489.76,12437.14,52.62,0.423088
1,2,12489.05,12516.62,-27.57,-0.220267
2,3,12513.75,12488.19,25.56,0.204673
3,4,12523.29,12488.80,34.49,0.276167
4,5,12475.90,12507.41,-31.51,-0.251931
5,6,12496.21,12512.34,-16.13,-0.128913
6,7,12524.68,12488.95,35.73,0.286093
7,8,12481.03,12490.46,-9.43,-0.075498
8,9,12498.48,12486.81,11.67,0.093459
9,10,12509.31,12514.40,-5.09,-0.040673

–î–∞–Ω–Ω—É—é –∑–∞–¥–∞—á—É –º–æ–∂–Ω–æ —Ä–µ—à–∏—Ç—å –±–µ–∑ –ø—Ä–∏–º–µ–Ω–µ–Ω–∏—è –æ–∫–æ–Ω–Ω—ã—Ö —Ñ—É–Ω–∫—Ü–∏–π, —Å –ø–æ–º–æ—â—å—é –¥–∂–æ–π–Ω–æ–≤ –ø–æ –º–µ—Å—è—Ü—É –¥–≤—É—Ö –ø–æ–¥–∑–∞–ø—Ä–æ—Å–æ–≤ —Å –æ—Ç–æ–±—Ä–∞–Ω–Ω—ã–º–∏ –ø–æ –≥–æ–¥—É –¥–∞–Ω–Ω—ã–º–∏.

In [20]:
# 2–æ–π –≤–∞—Ä–∏–∞–Ω—Ç  ‚ùå
# –ü–æ–¥–∑–∞–ø—Ä–æ—Å 1 –¥–ª—è –≤—ã—á–∏—Å–ª–µ–Ω–∏—è —Å—Ä–µ–¥–Ω–µ–≥–æ –∑–Ω–∞—á–µ–Ω–∏—è total_price –∑–∞ 2024 –≥–æ–¥
# –ü–æ–¥–∑–∞–ø—Ä–æ—Å 2 –¥–ª—è –≤—ã—á–∏—Å–ª–µ–Ω–∏—è —Å—Ä–µ–¥–Ω–µ–≥–æ –∑–Ω–∞—á–µ–Ω–∏—è total_price –∑–∞ –ø—Ä–µ–¥—ã–¥—É—â–∏–π 2023 –≥–æ–¥

sql = ''' 

WITH avg_2024 AS (
SELECT 
CAST(EXTRACT(MONTH FROM created_at) AS INTEGER) AS month,
ROUND(AVG(total_price), 2) AS avg_money_2024
FROM orders
WHERE CAST(EXTRACT(YEAR FROM created_at) AS INTEGER) = 2024
GROUP BY month
),

avg_last_year AS (
SELECT 
CAST(EXTRACT(MONTH FROM created_at) AS INTEGER) AS month,
ROUND(AVG(total_price), 2) AS last_year_avg_money
FROM orders
WHERE CAST(EXTRACT(YEAR FROM created_at) AS INTEGER) = 2023
GROUP BY month
)

SELECT 
a.month,
a.avg_money_2024,
l.last_year_avg_money,
(a.avg_money_2024 - l.last_year_avg_money) AS absolute_increase,
(((a.avg_money_2024 / l.last_year_avg_money) - 1) * 100) AS growth_rate_in_percentage
FROM avg_2024 a
LEFT JOIN avg_last_year l ON a.month = l.month
ORDER BY a.month;
'''

select(sql)

# –ó–∞–ø—Ä–æ—Å —Å –¥–∂–æ–π–Ω–∞–º–∏ –≤—ã–ø–æ–ª–Ω—è–µ—Ç –¥–≤–∞ –ø–æ–¥–∑–∞–ø—Ä–æ—Å–∞ –∏ –∑–∞—Ç–µ–º –æ–±—ä–µ–¥–∏–Ω—è–µ—Ç —Ä–µ–∑—É–ª—å—Ç–∞—Ç—ã, —á—Ç–æ –º–æ–∂–µ—Ç –±—ã—Ç—å –º–µ–Ω–µ–µ —ç—Ñ—Ñ–µ–∫—Ç–∏–≤–Ω—ã–º –¥–ª—è –±–æ–ª—å—à–∏—Ö –Ω–∞–±–æ—Ä–æ–≤ –¥–∞–Ω–Ω—ã—Ö.

,month,avg_money_2024,last_year_avg_money,absolute_increase,growth_rate_in_percentage
0,1,12489.76,12437.14,52.62,0.423088
1,2,12489.05,12516.62,-27.57,-0.220267
2,3,12513.75,12488.19,25.56,0.204673
3,4,12523.29,12488.80,34.49,0.276167
4,5,12475.90,12507.41,-31.51,-0.251931
5,6,12496.21,12512.34,-16.13,-0.128913
6,7,12524.68,12488.95,35.73,0.286093
7,8,12481.03,12490.46,-9.43,-0.075498
8,9,12498.48,12486.81,11.67,0.093459
9,10,12509.31,12514.40,-5.09,-0.040673

_______________________________________

4. –ù–∞–π—Ç–∏ 10 –ø–æ–ª—å–∑–æ–≤–∞—Ç–µ–ª–µ–π, —É –∫–æ—Ç–æ—Ä—ã—Ö –Ω–∞–∏–±–æ–ª—å—à–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ –∑–∞ –ø–æ—Å–ª–µ–¥–Ω–∏–π –≥–æ–¥, –∏ –¥–ª—è –∫–∞–∂–¥–æ–≥–æ –∏–∑ –Ω–∏—Ö –Ω–∞–π—Ç–∏ —Å—Ä–µ–¥–Ω–∏–π —Ä–∞–∑–º–µ—Ä –∑–∞–∫–∞–∑–∞ –∑–∞ –ø–æ—Å–ª–µ–¥–Ω–∏–π –º–µ—Å—è—Ü.  
–ü–æ—Å–ª–µ–¥–Ω–∏–π –º–µ—Å—è—Ü: –∞–≤–≥—É—Å—Ç 2024.

In [21]:
# 1 —à–∞–≥. –ù–∞–π–¥—ë–º 10 —é–∑–µ—Ä–æ–≤ —Å –Ω–∞–∏–±–æ–ª—å—à–∏–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∑–∞–∫–∞–∑–æ–≤ –∑–∞ –ø–æ—Å–ª–µ–¥–Ω–∏–π –≥–æ–¥ 
# 2 —à–∞–≥. –ü–æ–ª—É—á–∏–≤ –Ω–µ–æ–±—Ö–æ–¥–∏–º—ã–π —Å–ø–∏—Å–æ–∫ —é–∑–µ—Ä–æ–≤, –æ—Ç–±–µ—Ä—ë–º –∏—Ö –∏–∑ –æ—Å–Ω–æ–≤–Ω—ã—Ö –¥–∞–Ω–Ω—ã—Ö —Å –ø–æ–º–æ—â—å—é INNER JOIN. 
# 3 —à–∞–≥. –£–∑–Ω–∞–µ–º –∏–º—è –∏ email —ç—Ç–∏—Ö —Ç–æ–≤–∞—Ä–∏—â–µ–π, –ø—Ä–∏—Å–æ–µ–¥–∏–Ω–∏–≤ —Ç–∞–±–ª–∏—Ü—É users.

sql = ''' 
WITH cte AS (SELECT 
                    user_id,
                    COUNT(DISTINCT id) AS cnt_orders
               FROM orders
              WHERE EXTRACT(YEAR FROM created_at) = 2024
              GROUP BY 1
              ORDER BY 2 DESC
              LIMIT 10) -- 1 —à–∞–≥


SELECT  
       TO_CHAR(DATE_TRUNC('month', o.created_at), 'YYYY-MM') AS month,
       o.user_id,
       u.name,
       u.email,
       AVG(o.total_price) AS avg_order_size
FROM orders o 
     INNER JOIN cte 
        ON o.user_id = cte.user_id --2 —à–∞–≥
     INNER JOIN  users u 
        ON cte.user_id = u.id --3 —à–∞–≥
     WHERE DATE_TRUNC('month', o.created_at) = DATE '2024-08-01'
GROUP BY 1, 2, 3, 4

            '''
select(sql)

,month,user_id,name,email,avg_order_size
0,2024-08,2272629,Timothy Ward,timothy.ward2272628@googlyandex.com,13457.105263

________________________________________________

In [22]:
# –ü–æ—Å–ª–µ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏—è —Å–æ–µ–¥–∏–Ω–µ–Ω–∏—è —Å –±–∞–∑–æ–π –¥–∞–Ω–Ω—ã—Ö —á–µ—Ä–µ–∑ SQLAlchemy, 
# —Ä–µ–∫–æ–º–µ–Ω–¥—É–µ—Ç—Å—è —è–≤–Ω–æ –∑–∞–∫—Ä—ã–≤–∞—Ç—å —Å–æ–µ–¥–∏–Ω–µ–Ω–∏–µ, —á—Ç–æ–±—ã –æ—Å–≤–æ–±–æ–¥–∏—Ç—å —Ä–µ—Å—É—Ä—Å—ã. 
conn.dispose()